//コメント解除は　shift + K + U

// var a1 =2;
// if (a1 < 10) {
//   document.write ("A");
// }

// //もしa1が10より小さい場合、「A」を表示する

// //------------------------------------------

// var a12 = 10;
// if (a2 <= 10) {
//   document.write ("B");
// }

// //もしa2が10以下の場合、「B」を表示する

// //-----------------------------------------

// var a3 = 12;
// if (a3 == 12) {
//   document.write ("同じ数字");
// }

// //もしa3が12と同じ場合、「同じ数字」と表示する

// //----------------------------------------

// var a4 = 12;
// if (a4 == "田中") {
//   document.write (a4 + "さんです");
// }

// //もしa4が12と同じ場合、「田中」と表示する

// //---------------------------------------

// var b1 = 90;
// if (100 <= b1) {
//   document.write ("100より小さい数です");
// }

// //もしｂ1が100より小さい場合、「100より小さい数です」

// //-------------------------------------

// var b2 = 3;
// if (b2<1) {
//   document.write("A");
// } else if (b2>1) {
//   document.write("B");
// }

//もしｂ2が１より小さい場合、「Ａ」を表示し、1より大きい場合、「Ｂ」を表示する

//------------------------------------

// var b3 = 10;
// if (b3 < 10) {
//   document.write("X");
// }else if (b3 > 5) {
//   document.write("Y");
// }

// //もしｂ3が10より小さい場合「Ｘ」を、５より大きい場合「Ｙ」を表示する

// //------------------------------------

// var b4 = 1;
// if (b4 == 0) {
//   document.write ("数字は0");
// }else if (b4 == 1);{
//   document.write ("数字は１");
// }else if (b4 == 2);{
//   document.write("数字は２");
// }

// //もしｂ４が０と同じ場合、「数字は０」と、1と同じ場合「数字は１」と、２と同じ場合「数字は２」と表示する

// //-------------------------------------

// var b5 = -8;
// if (b5 < 0){
//   document.write("マイナス");
// }else if (b5 >= 1){
//   document.write("プラス");
// }

// //もしｂ５が０より小さい場合「マイナス」、０より大きい場合「プラス」と表示する

//---------------------------------------

// var c3 ="A";
// if(c3 == "B") {
//   document.write("B");
// }else {
//   document.write ("その他");
// }

//もしｃ３が「Ｂ」と同じだった場合、「Ｂ」と、そうでない場合「その他」と表示する

//---------------------------------------

// var c4 = 5;
// if (c4 > 0 && c4 < 10) {
//   document.write("B");
// }else {
//   document.write ("その他");
// }

// //もしｃ４が０より大きく、かつ１０より小さい場合、「Ｂ」と、そうでない場合「その他」と表示する

// //--------------------------------------

// var c5 = 10;
// if (c5 >= 10 || c5 < 5 ) {
//   document.write ("X");
// }else {
//   document.write ("Y");
// }

//もしｃ５が１０以上　または　５より小さい場合、「Ｘ」と、それ以外は「Ｙ」と表示する





//--------ここから下が　8時間目～if文応用～-------------------------------------------------------

// var a1 = 5;
// if (a1 > 0){
//   if (a1 < 10) {
//     document.write ("A");
//   }
// }

// //もしa1が0より大きく、かつ、もし10より小さい場合、「A」と表示する

// //--------------------------------------------

// var a4 = 5;
// if (a4 < 3) {
//   document.write ("A");
// } else if (a4 < 5) {
//   document.write ("B");
// } else {
//   document.write ("C");
// }

// //もしa4が３よりちいさい場合「A」、それ以外で５より小さい場合は「B」、それ以外は「C」と表示する

// //---------------------------------------------

// var a5 = 6;
// if (a5 > 10) {
//   document.write ("A");
// } else if (a5 < 5 || a5 == 6){
//   document.write ("B");
// } else {
//   document.write ("C");
// }

// //もしa5が10より小さい場合、「A」と、それ以外でa5が５より小さいまたは６と同じ場合、「B」、それ以外の場合「C」とひょうじする

// //----------------------------------------------

// var age = 18;
// var seibetsu = "女性";

// if (age >= 18) {
//   if (seibetsu == "女性") {
//     document.write("Aさん");
//   } else if (seibetsu == "男性") {
//     document.write ("Bさん");
//   } else {
//     document.write ("Cさん");
//   }
// }

// //もし　age　が１８以上で、かつ、 seibetsu が女性の場合「Aさん」、もしくは seibetsu が男性の場合「Ｂさん」、それ以外は「Ｃさん」と表示する

// //----------------------------------------------

// var month = 5;
// var day = 28;

// if (month <= 12) {
//   if (day <= 15) {
//     document.write ("月の前半");
//   } else if (day >= 15) {
//     document.write ("月の後半");
//   }
// }

//もしmonthが１２以下だった場合、かつ、dayが15以下だった場合、「月の前半」と表示し、
//もしmonthが１２以下だった場合、かつ、dayが15以上だった場合、「月の後半」と表示する。

//---------9時間目　switch文------------------------------------

// var a1 = 1;

// switch(a1) {
//   case 0:
//     document.write ("A");
//     break;

//   case 1: {
//     document.write ("B");
//     break;
//   }
// }

// //もしa1が0だった場合、「A」と表示し、１だった場合、「B」と表示する

// //-------------------------------------------

// var a2 = 3;

// switch (a2) {
//   case 0 :
//     document.write ("A");
//     break;
//   case 1:
//     document.write ("B");
//     break;
//   default:
//     document.write ("C");
// }

// //もしa2が0の場合、「A」と表示し、１の場合「B」と表示し、どのケースにも該当しない場合、「C」と表示する

// //------------------------------------------

// var a3 ="青";

// switch(a3){
//   case "赤":
//     document.write ("赤組");
//     break;

//   case "白":
//     document.write ("白組");
//     break;

//   case "青":
//     document.write ("青");
//     break;
// }

// //もし　a3　が赤の場合、「赤組」と表示し、白の場合「白組」と表示し、青の場合「青組」と表示する

// //----------------------------------------

// var star = "☆";

// switch (star) {
//   case "★":
//     document.write ("黒い星です");
  
//   case "☆":
//     document.write ("白い星です");
  
//   default:
//     document.write ("その他記号です");
// }

// //もし　star が★の場合、「黒い星です」と表示し、☆の場合、「白い星です」と表示し、そのほかの場合、「その他記号です」と表示する

// //--------------------------------------

// var age = 70;

// switch (age) {
//   case 70:
//     document.write ("古希");
//     break;
  
//   case 80:
//     document.write ("米寿");
//     break;

//   default:
//     document.write (age + "歳");
//     break;
// }

// //もし　age が70の場合、「古希」と表示し、80の場合、「米寿」と表示し、その他の場合、「age歳」と表示する

// //------------------------------------


// var score =99;

// switch (score) {
//   case 99:
//     document.write ("おしい！");
//     break;

//   case 100:
//     document.write ("満点です！");
//     break;

//   default:
//     document.write (score + "点です！");
//     break;
// }


//------10時間目　for文基礎---------------------------------------

// for (var i= 1; i <= 10; i++ ) {
//   document.write(i);
//   document.write("/");
// } 

// //-------------------------------------------

// for (var a= 10; a >= 0; a-- ) {
//   document.write(a);
//   document.write("/");
// } 

// //-------------------------------------------

// for (var b= 1; b < 7; b++ ) {
//   document.write(b);
//   document.write("<br>");
// } 

//------------------------------------------

for (var star = 1; star < 5; star ++) {
  document.write("★");
  document.write("<br>");
}

//---------------------------------------------

for (var month = 1; month <= 12; month++) {
  document.write(month);
  document.write("月/");
}

//-------------------------------------------

for (var age = 18; age <= 33; age++) {
  document.write(age + "歳");
  document.write("<br>")
}

//------------------------------------------

for (var day = 1; day <= 31; day++) {
  document.write (day + "日");
  document.write ("<br>");
}

//------------------------------------------

for (var num = 1; num <= 40; num++) {
  document.write (num + "番");
  document.write ("<br>");
}

//------------------------------------------

